# Pandas

In [ ]:
# Numpy ### when we deeal with numbers
# pandas ### when we deal with data sets and data frames

In [25]:
import pandas as pd

### Series

In [8]:
sports1=pd.Series([1,2,3,4],  index=['cricket','football','basketball','golf'])
sports1

###dtype is int

cricket       1
football      2
basketball    3
golf          4
dtype: int64

In [ ]:


sports1=pd.Series([1,2,3,4],  index=['cricket','football','basketball','golf'])
sports1

###dtype is int

In [9]:
sports1['basketball']

3

In [10]:
sports2=pd.Series([11,13,12,4],index=['cricket', 'baseball','football','golf'])
sports2

### dtype is int

cricket     11
baseball    13
football    12
golf         4
dtype: int64

In [12]:
sports2['baseball']

13

In [11]:
sports1+sports2

###arithmetic operators result is always float
### dtype is float
### NaN - Not a Number

baseball       NaN
basketball     NaN
cricket       12.0
football      14.0
golf           8.0
dtype: float64

### Dataframe

In [24]:
import numpy as np

In [18]:
df2={'ID':[101,102,103,107,176], 'Name':['John','Mercy','Akash','Kavin','Lally'],'Profit':[20,54,56,87,123]}
df=pd.DataFrame(df2)
df

    ID   Name  Profit
0  101   John      20
1  102  Mercy      54
2  103  Akash      56
3  107  Kavin      87
4  176  Lally     123

In [19]:
df.drop('ID',axis=1)

## whenever we use function use ()
## if we want to drop a colun always mention axis=1
### when axis is 1 then it checks for the name in the column names
## by default when .drop() is used it checks for rows and not columns
### it only checks for column when the axis=1

    Name  Profit
0   John      20
1  Mercy      54
2  Akash      56
3  Kavin      87
4  Lally     123

In [20]:
df['Name']

## whenever we slice the table its []

0     John
1    Mercy
2    Akash
3    Kavin
4    Lally
Name: Name, dtype: object

In [26]:
### for multiple elements always use double [[]]

df[['Name','ID']]

    Name   ID
0   John  101
1  Mercy  102
2  Akash  103
3  Kavin  107
4  Lally  176

In [34]:
df.drop(3)

### here the axis arguement is not required as we want to drop a row

    ID   Name  Profit
0  101   John      20
1  102  Mercy      54
2  103  Akash      56
4  176  Lally     123

In [35]:
df

    ID   Name  Profit
0  101   John      20
1  102  Mercy      54
2  103  Akash      56
3  107  Kavin      87
4  176  Lally     123

In [44]:
dm= df.drop('ID',axis=1)

In [42]:
df

    ID   Name  Profit
0  101   John      20
1  102  Mercy      54
2  103  Akash      56
3  107  Kavin      87
4  176  Lally     123

In [43]:
dm

    Name  Profit
0   John      20
1  Mercy      54
2  Akash      56
3  Kavin      87
4  Lally     123

In [27]:
df1=pd.DataFrame(np.random.rand(8,5), index='A B C D E F G H'.split(), columns='Score1 Score2 Score3 Score4 Score5'.split())
df1

### we use .split() to split all the rows and column names
### make sure you run numpy library as well

     Score1    Score2    Score3    Score4    Score5
A  0.220259  0.245053  0.056936  0.319277  0.528530
B  0.788291  0.141363  0.542390  0.671473  0.814983
C  0.340005  0.842388  0.852474  0.972193  0.447404
D  0.726933  0.790302  0.521901  0.782036  0.520433
E  0.026630  0.100251  0.167408  0.545108  0.182429
F  0.577794  0.350579  0.663217  0.129456  0.730906
G  0.645256  0.740533  0.402918  0.528236  0.745698
H  0.641171  0.406179  0.384770  0.124535  0.751422

In [28]:
df1['Score3']

### when we need a specific column this is used

A    0.056936
B    0.542390
C    0.852474
D    0.521901
E    0.167408
F    0.663217
G    0.402918
H    0.384770
Name: Score3, dtype: float64

In [29]:
df1[['Score2','Score1','Score5']]

     Score2    Score1    Score5
A  0.245053  0.220259  0.528530
B  0.141363  0.788291  0.814983
C  0.842388  0.340005  0.447404
D  0.790302  0.726933  0.520433
E  0.100251  0.026630  0.182429
F  0.350579  0.577794  0.730906
G  0.740533  0.645256  0.745698
H  0.406179  0.641171  0.751422

In [32]:
df1['Score6']=df1['Score1']+df1['Score2']+df1['Score3']+df1['Score4']+df1['Score5']
df1

### a new column is defined and the values of all the rows is added and shown in score6

     Score1    Score2    Score3    Score4    Score5    Score6
A  0.220259  0.245053  0.056936  0.319277  0.528530  1.370054
B  0.788291  0.141363  0.542390  0.671473  0.814983  2.958501
C  0.340005  0.842388  0.852474  0.972193  0.447404  3.454464
D  0.726933  0.790302  0.521901  0.782036  0.520433  3.341606
E  0.026630  0.100251  0.167408  0.545108  0.182429  1.021826
F  0.577794  0.350579  0.663217  0.129456  0.730906  2.451952
G  0.645256  0.740533  0.402918  0.528236  0.745698  3.062640
H  0.641171  0.406179  0.384770  0.124535  0.751422  2.308077

In [33]:
df1['Score6']

A    1.370054
B    2.958501
C    3.454464
D    3.341606
E    1.021826
F    2.451952
G    3.062640
H    2.308077
Name: Score6, dtype: float64

In [47]:
df1.drop('E')

     Score1    Score2    Score3    Score4    Score5    Score6
A  0.220259  0.245053  0.056936  0.319277  0.528530  1.370054
B  0.788291  0.141363  0.542390  0.671473  0.814983  2.958501
C  0.340005  0.842388  0.852474  0.972193  0.447404  3.454464
D  0.726933  0.790302  0.521901  0.782036  0.520433  3.341606
F  0.577794  0.350579  0.663217  0.129456  0.730906  2.451952
G  0.645256  0.740533  0.402918  0.528236  0.745698  3.062640
H  0.641171  0.406179  0.384770  0.124535  0.751422  2.308077

In [48]:
df1

     Score1    Score2    Score3    Score4    Score5    Score6
A  0.220259  0.245053  0.056936  0.319277  0.528530  1.370054
B  0.788291  0.141363  0.542390  0.671473  0.814983  2.958501
C  0.340005  0.842388  0.852474  0.972193  0.447404  3.454464
D  0.726933  0.790302  0.521901  0.782036  0.520433  3.341606
E  0.026630  0.100251  0.167408  0.545108  0.182429  1.021826
F  0.577794  0.350579  0.663217  0.129456  0.730906  2.451952
G  0.645256  0.740533  0.402918  0.528236  0.745698  3.062640
H  0.641171  0.406179  0.384770  0.124535  0.751422  2.308077